Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-MC_DFP/1.2.52/PIC32CM1216MC00048/edc/PIC32CM1216MC00048.PIC
      <edc:AdjustPoint edc:_addr="0x4100A150" edc:offset="0xFF5EB0"/>
      <edc:SFRDef edc:_addr="0x42000000" edc:access="-------n" edc:cname="CTRLA" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42000001" edc:offset="0xB"/>
      <edc:SFRDef edc:_addr="0x4200000C" edc:access="----rrrrrrrrrrrr----rrrrrrrrrrrr" edc:cname="CHSTATUS" edc:impl="0xFFF0FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USRRDY0" edc:desc="Channel 0 User Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USRRDY1" edc:desc="Channel 1 User Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USRRDY2" edc:desc="Channel 2 User Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USRRDY3" edc:desc="Channel 3 User Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USRRDY4" edc:desc="Channel 4 User Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USRRDY5" edc:desc="Channel 5 User Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USRRDY6" edc:desc="Channel 6 User Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USRRDY7" edc:desc="Channel 7 User Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USRRDY8" edc:desc="Channel 8 User Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USRRDY9" edc:desc="Channel 9 User Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USRRDY10" edc:desc="Channel 10 User Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USRRDY11" edc:desc="Channel 11 User Ready" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CHBUSY0" edc:desc="Channel 0 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY1" edc:desc="Channel 1 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY2" edc:desc="Channel 2 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY3" edc:desc="Channel 3 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY4" edc:desc="Channel 4 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY5" edc:desc="Channel 5 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY6" edc:desc="Channel 6 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY7" edc:desc="Channel 7 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY8" edc:desc="Channel 8 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY9" edc:desc="Channel 9 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY10" edc:desc="Channel 10 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY11" edc:desc="Channel 11 Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000010" edc:access="----nnnnnnnnnnnn----nnnnnnnnnnnn" edc:cname="INTENCLR" edc:impl="0xFFF0FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="OVR0" edc:desc="Channel 0 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR1" edc:desc="Channel 1 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR2" edc:desc="Channel 2 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR3" edc:desc="Channel 3 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR4" edc:desc="Channel 4 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR5" edc:desc="Channel 5 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR6" edc:desc="Channel 6 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR7" edc:desc="Channel 7 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR8" edc:desc="Channel 8 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR9" edc:desc="Channel 9 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR10" edc:desc="Channel 10 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR11" edc:desc="Channel 11 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="EVD0" edc:desc="Channel 0 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD1" edc:desc="Channel 1 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD2" edc:desc="Channel 2 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD3" edc:desc="Channel 3 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD4" edc:desc="Channel 4 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD5" edc:desc="Channel 5 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD6" edc:desc="Channel 6 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD7" edc:desc="Channel 7 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD8" edc:desc="Channel 8 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD9" edc:desc="Channel 9 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD10" edc:desc="Channel 10 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD11" edc:desc="Channel 11 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000014" edc:access="----nnnnnnnnnnnn----nnnnnnnnnnnn" edc:cname="INTENSET" edc:impl="0xFFF0FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="OVR0" edc:desc="Channel 0 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR1" edc:desc="Channel 1 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR2" edc:desc="Channel 2 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR3" edc:desc="Channel 3 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR4" edc:desc="Channel 4 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR5" edc:desc="Channel 5 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR6" edc:desc="Channel 6 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR7" edc:desc="Channel 7 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR8" edc:desc="Channel 8 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR9" edc:desc="Channel 9 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR10" edc:desc="Channel 10 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR11" edc:desc="Channel 11 Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="EVD0" edc:desc="Channel 0 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD1" edc:desc="Channel 1 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD2" edc:desc="Channel 2 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD3" edc:desc="Channel 3 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD4" edc:desc="Channel 4 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD5" edc:desc="Channel 5 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD6" edc:desc="Channel 6 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD7" edc:desc="Channel 7 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD8" edc:desc="Channel 8 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD9" edc:desc="Channel 9 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD10" edc:desc="Channel 10 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD11" edc:desc="Channel 11 Event Detection Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000018" edc:access="----nnnnnnnnnnnn----nnnnnnnnnnnn" edc:cname="INTFLAG" edc:impl="0xFFF0FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="OVR0" edc:desc="Channel 0 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR1" edc:desc="Channel 1 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR2" edc:desc="Channel 2 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR3" edc:desc="Channel 3 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR4" edc:desc="Channel 4 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR5" edc:desc="Channel 5 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR6" edc:desc="Channel 6 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR7" edc:desc="Channel 7 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR8" edc:desc="Channel 8 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR9" edc:desc="Channel 9 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR10" edc:desc="Channel 10 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR11" edc:desc="Channel 11 Overrun" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="EVD0" edc:desc="Channel 0 Event Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD1" edc:desc="Channel 1 Event Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD2" edc:desc="Channel 2 Event Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD3" edc:desc="Channel 3 Event Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD4" edc:desc="Channel 4 Event Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD5" edc:desc="Channel 5 Event Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD6" edc:desc="Channel 6 Event Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD7" edc:desc="Channel 7 Event Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD8" edc:desc="Channel 8 Event Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD9" edc:desc="Channel 9 Event Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD10" edc:desc="Channel 10 Event Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD11" edc:desc="Channel 11 Event Detection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200001C" edc:access="--------------------wwwwwwwwwwww" edc:cname="SWEVT" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL0" edc:desc="Channel 0 Software Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL1" edc:desc="Channel 1 Software Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL2" edc:desc="Channel 2 Software Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL3" edc:desc="Channel 3 Software Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL4" edc:desc="Channel 4 Software Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL5" edc:desc="Channel 5 Software Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL6" edc:desc="Channel 6 Software Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL7" edc:desc="Channel 7 Software Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL8" edc:desc="Channel 8 Software Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL9" edc:desc="Channel 9 Software Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL10" edc:desc="Channel 10 Software Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL11" edc:desc="Channel 11 Software Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
